tiborsimon/embedded-tdd-headers/pic/8bit/pic12c671_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC12C671_H_
#define _PIC12C671_H_

#define INDF                          0
#define TMR0                          1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define RP0                           11
#define RP                            12
#define RP1                           13
#define IRP                           14
#define FSR                           15
#define GPIO                          16
#define GP0                           17
#define GP1                           18
#define GP2                           19
#define GP3                           20
#define GP4                           21
#define GP5                           22
#define PCLATH                        23
#define INTCON                        24
#define GPIF                          25
#define INTF                          26
#define T0IF                          27
#define GPIE                          28
#define INTE                          29
#define T0IE                          30
#define PEIE                          31
#define GIE                           32
#define PIR1                          33
#define ADIF                          34
#define ADRES                         35
#define ADCON0                        36
#define ADON                          37
#define nDONE                         38
#define GO_nDONE                      39
#define GO_DONE                       40
#define GO                            41
#define CHS0                          42
#define CHS                           43
#define CHS1                          44
#define ADCS0                         45
#define ADCS                          46
#define ADCS1                         47
#define OPTION_REG                    48
#define PS                            49
#define PS0                           50
#define PS1                           51
#define PS2                           52
#define PSA                           53
#define T0SE                          54
#define T0CS                          55
#define INTEDG                        56
#define nGPPU                         57
#define TRIS                          58
#define TRIS0                         59
#define TRIS1                         60
#define TRIS2                         61
#define TRIS3                         62
#define TRIS4                         63
#define TRIS5                         64
#define PIE1                          65
#define ADIE                          66
#define PCON                          67
#define nPOR                          68
#define OSCCAL                        69
#define CALSLW                        70
#define CALFST                        71
#define CAL0                          72
#define CAL                           73
#define CAL1                          74
#define CAL2                          75
#define CAL3                          76
#define ADCON1                        77
#define PCFG0                         78
#define PCFG                          79
#define PCFG1                         80
#define PCFG2                         81

#endif // _PIC12C671_H_
